[Reward_NormalRescue X2RewardTemplate]
DisplayName="准备救援行动"
RewardDetails="解锁任务以营救被俘士兵"

[Reward_CAGuerillaOp X2RewardTemplate]
DisplayName="准备游击行动"
RewardDetails="解锁任务以发起游击行动"

[Reward_CASupplyRaid X2RewardTemplate]
DisplayName="准备补给突袭行动"
RewardDetails="解锁任务以发起补给突袭行动."

[Reward_PrepResOp X2RewardTemplate]
DisplayName="准备反抗行动"
RewardDetails="解锁任务以发起反抗行动"

[RescueSoldierGeneric X2MissionFlavorTextTemplate]
FlavorText="缺少描述文本"
CouncilSpokesmanSuccessText="令人影响深刻的壮举, 指挥官. 你的士兵一定会很高兴能从变种人的手中解脱出来"
CouncilSpokesmanFailureText="一次英勇的尝试, 指挥官, 但不幸的是被俘虏的士兵仍然在变种人手中"


[CovertAction_PrepareRescue X2CovertActionTemplate]
ActionObjective="准备救援行动"

[CovertAction_PrepareGOp X2CovertActionTemplate]
ActionObjective="准备游击行动"

[CovertAction_PrepareRaid X2CovertActionTemplate]
ActionObjective="准备补给突袭行动"

[CovertAction_PrepareResOp X2CovertActionTemplate]
ActionObjective="准备反抗行动"

[CovertActionNarrative_PrepareResOp X2CovertActionNarrativeTemplate]
ActionName="准备反抗行动"
ActionPreNarrative="与我们合作的一名抵抗组织特工在上次例行报告时失去联系, 抵抗组织军希望 XCOM 帮助找出原因"
ActionPostNarrative="看起来特工遇到了麻烦, 我们需要你的帮助, 指挥官 "

[CovertActionNarrative_PrepareRaid X2CovertActionNarrativeTemplate]
ActionName="准备补给突袭行动"
ActionPreNarrative="我们在该地区的联络人为我们提供了补给列车的有关线索. 如果我们派几个特工跟进, 我们就有机会为反抗行动获得额外资源"
ActionPostNarrative="我们的秘密行动团队已经完成了他们的侦察任务, 现在由我们来接手这项工作"

[CovertActionNarrative_PrepareGOp X2CovertActionNarrativeTemplate]
ActionName="准备游击行动"
ActionPreNarrative="我们在该地区的联络人为我们提供了变种人行动的线索. 如果我们派几个特工跟进, 我们可以了解变种人的动向"
ActionPostNarrative="我们的秘密行动团队已经完成了他们的计划, 准备战斗, 指挥官"

[CovertActionNarrative_PrepareRescue X2CovertActionNarrativeTemplate]
ActionName="准备救援行动"
ActionPreNarrative="我们在该地区的联络人提供了有关被俘士兵关押在安全设施中的线索, 如果我们发起秘密行动, 就必须一锤定音,目前没有更好的时机了"
ActionPostNarrative="我们的秘密行动团队已经完成了他们的前期调查工作. 是时候动身了, 指挥官."




